package org.myApplication.domain.enums;

/**
 * Enum из предлагаемого при регистрации списка жанров
 *
 * @autor Мельникова Полина
 */
public enum Genres {
    /**
     * Элемент перечисляемого типа жанров - новелла
     */
    NOVEL,
    /**
     * Элемент перечисляемого типа жанров - детектив
     */
    DETECTIVE,
    /**
     * Элемент перечисляемого типа жанров - приключения
     */
    ADVENTURES,
    /**
     * Элемент перечисляемого типа жанров - ужасы
     */
    HORRORS,
    /**
     * Элемент перечисляемого типа жанров - фантастика
     */
    FANTASY
}
